ХамелионЦРПТ/src/Documents/ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ/ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>feed_id</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аттрибуты</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеГруппы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОШибки</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/Enums/СтатусыДокументов_ХамелеонЦРПТ/СтатусыДокументов_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументов_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтвета</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ФайлОбработанЧастично</name>
  </enumValues>
  <enumValues>
    <name>ОтправленЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ЧерновикОбработан</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийПромежуточныйСтатус</name>
  </enumValues>
  <enumValues>
    <name>ПринятИПереданВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>КМЧастичноЭмитированы</name>
  </enumValues>
  <enumValues>
    <name>КМЭмитирован</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтветаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессе</name>
  </enumValues>
  <enumValues>
    <name>ОжидаемРегистрациюУчастникавИСМП</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПринят</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВЭДО</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/СтатусыКарточекВНК_ХамелеонЦРПТ/СтатусыКарточекВНК_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточекВНК_ХамелеонЦРПТ</name>
  <enumValues>
    <name>draft</name>
  </enumValues>
  <enumValues>
    <name>moderation</name>
    <comment>На модерации</comment>
  </enumValues>
  <enumValues>
    <name>published</name>
    <comment>Опубликована</comment>
  </enumValues>
  <enumValues>
    <name>notsigned</name>
    <comment>Ожидает подписания</comment>
  </enumValues>
  <enumValues>
    <name>errors</name>
  </enumValues>
  <enumValues>
    <name>archive</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаВНК</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Функция ВернуттьД(Массив_1,ТекущийПользователь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.Ссылка,
		|	ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.feed_id КАК _Order_ID
		|ИЗ
		|	Документ.ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ КАК ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ
		|ГДЕ
		|	ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.Статус В(&Статус)
		|	И ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.Ссылка В(&ДокументПроверки)
		|	И ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.ТекущийПользователь.Организация.ИНН = &ИНН
		//|	И ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.ТекущийПользователь.СайтыВходаВСистему.Наименование = &СайтыВходаВСистему
		|";
	
	СписокСтатусов=Новый СписокЗначений;
	//СписокСтатусов.Добавить(Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отказ);
	СписокСтатусов.Добавить(Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ОтправленЧерновик);
	СписокСтатусов.Добавить(Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отправлен);
	СписокСтатусов.Добавить(Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ВнутреннийПромежуточныйСтатус);
	СписокСтатусов.Добавить(Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ПринятИПереданВПроизводство);
	СписокСтатусов.Добавить(Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЧастичноЭмитированы);
	
	Запрос.УстановитьПараметр("ИНН",	ТекущийПользователь.Организация.ИНН); 
//	Запрос.УстановитьПараметр("СайтыВходаВСистему",	ТекущийПользователь.СайтыВходаВСистему.Наименование); 
	
	Запрос.УстановитьПараметр("ДокументПроверки",	Массив_1); 
	
	Запрос.УстановитьПараметр("Статус",	СписокСтатусов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Массив_1=Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Массив_1.Добавить(Новый Структура("order_id,Ссылка",ВыборкаДетальныеЗаписи._Order_ID,ВыборкаДетальныеЗаписи.Ссылка));
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//КонецЕсли;
	Возврат Массив_1
	
	
Конецфункции


&НаСервереБезКонтекста
Функция ПолучитьИзПользователя(ТекущийПользователь)
	Возврат Обработки._Запуск_ХамелеонЦРПТ.ПолучитьИзПользователя(ТекущийПользователь);	
Конецфункции

&НаКлиенте
Процедура ОбновитьСтатусДокументов(Команда)
	// Вставить содержимое обработчика.
	
	Массив_1=Новый СписокЗначений;
	Для Каждого ССтр Из Элементы.Список.ВыделенныеСтроки Цикл
		Массив_1.Добавить(ССтр);		
	Конеццикла;
	
	ВернуттьД=ВернуттьД(Массив_1,ТекущийПользователь);
	Если ВернуттьД.Количество()>0 Тогда
		
		Thumbprint_1=ПолучитьИзПользователя(ТекущийПользователь);
		
		
Если ЗначениеЗаполнено(Thumbprint_1.КлючAPIККМТ) тогда
		КлючПодключения="apikey="+Thumbprint_1.КлючAPIККМТ;	
	Иначе
		
			СерийныйНомер="";

			СтруктураНастроек=Неопределено;                                                    СерийныйНомер="";
							СРегистра=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьТокенСрегистра(Thumbprint_1.Thumbprint_1,СтруктураНастроек);
									СерийныйНомер=СтруктураНастроек.СерийныйНомер;
							
								Если Не ЗначениеЗаполнено(СРегистра)  Тогда
									СРегистра=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.Получение_Токена(Thumbprint_1,СерийныйНомер);	
								Иначе
								   
										Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
											Прокси=Новый ИнтернетПрокси;
											Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
										
											HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресДляПолученияТокена,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
										Иначе
										
											HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.АдресДляПолученияТокена,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
										КонецЕсли;
										
										HTTPЗапрос=Новый HTTPЗапрос("api/v3/facade/balance/all");
										HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
										HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
										//HTTPЗапрос.Заголовки.Вставить("Host","ismotp.crptech.ru");
										///Константин           
										Ответ=HTTPСервисЗапрос.ВызватьHTTPМетод("GET",HTTPЗапрос);
										//Текст1=Ответ.ПолучитьТелоКакСтроку();
										Если Ответ.КодСостояния<>200 Тогда
											СРегистра=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.Получение_Токена(Thumbprint_1,СерийныйНомер);	
										КонецЕсли;
											
								КонецЕсли;
								Если Не ЗначениеЗАполнено(Срегистра) Тогда
									Возврат;
								Конецесли;
		КлючПодключения="";	
		
		
	Конецесли;
	
	
		Если ЗначениеЗАполнено(Thumbprint_1.АдресПрокси) Тогда
			Прокси=Новый ИнтернетПрокси;
			Прокси.Установить("http",Thumbprint_1.АдресПрокси,Thumbprint_1.ПортПрокси,Thumbprint_1.ПользовательПрокси,Thumbprint_1.ПарольПрокси);
			
			
		//	HTTPСервисЗапрос=Новый HTTPСоединение("account.integrators.nk.crpt.tech",,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
		//	HTTPСервисЗапрос=Новый HTTPСоединение("xn--j1ab.xn----7sbabas4ajkhfocclk9d3cvfsa.xn--p1ai",,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.КаталогСайтAPI,,,,Прокси,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
		Иначе
		///	HTTPСервисЗапрос=Новый HTTPСоединение("account.integrators.nk.crpt.tech",,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			//HTTPСервисЗапрос=Новый HTTPСоединение("xn--j1ab.xn----7sbabas4ajkhfocclk9d3cvfsa.xn--p1ai",,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
			HTTPСервисЗапрос=Новый HTTPСоединение(Thumbprint_1.КаталогСайтAPI,,,,,Thumbprint_1.Таймаут,Новый ЗащищенноеСоединениеopenSSL());
		КонецЕсли;
		
		
		
		
		//ОтправляемСначалаБезГТИН=Ложь;

	Для Каждого Стр_Ф Из ВернуттьД Цикл
		Если значениеЗаполнено(КлючПодключения ) тогда
			
			ЗапросТекст="v3/feed-status?apikey="+Thumbprint_1.КлючAPIККМТ+"&feed_id="+Стр_Ф.order_id+"&verbose=true";
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст);
		Иначе
			ЗапросТекст="v3/feed-status?feed_id="+Стр_Ф.order_id+"&verbose=true";
			HTTPЗапрос=Новый HTTPЗапрос(ЗапросТекст );
			HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
			HTTPЗапрос.Заголовки.Вставить("Authorization","Bearer "+СРегистра);
		Конецесли;
		Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния=200 Тогда
			
			NNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON_Соответствие(Ответ.ПолучитьТелоКакСтроку());

			
			ОбновитьИнформациюНасервере(NNN,Стр_Ф);
			//Статус=NNN["result"]["status"];
			//Если Статус="Rejected" Тогда
				
			
			
		Конецесли;
		
	
		
		
	Конеццикла;
Конецесли;
Элементы.Список.Обновить();
КонецПроцедуры

Процедура ОбновитьИнформациюНасервере(NNN,Стр_Ф)
	
	ПолОб=Стр_Ф.Ссылка.ПолучитьОбъект();
	Статус=NNN["result"]["status"];
	
	Если Статус="Rejected" Тогда
		ПолОб.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отказ;
	ИначеЕсли Статус="Received" Тогда
		полОб.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Обработан;
		
		
		Для Каждого Стр_11 Из ПолОб.Товары Цикл
			Если Стр_11.Продукция.СтатусКарточки<>Перечисления.СтатусыКарточекВНК_ХамелеонЦРПТ.draft 
				И ЗначениеЗаполнено(Стр_11.Продукция.GTIN)
				Тогда
				ПолОб_1=Стр_11.Продукция.ПолучитьОбъект();
				ПолОб_1.СтатусКарточки=Перечисления.СтатусыКарточекВНК_ХамелеонЦРПТ.draft;
				ПолОб_1.ЗаписатЬ();
			ИначеЕсли Не ЗначениеЗаполнено(Стр_11.Продукция.GTIN) Тогда
				
				ПолОб_1=Стр_11.Продукция.ПолучитьОбъект();
				ПолОб_1.СтатусКарточки=Неопределено;
				ПолОб_1.ЗаписатЬ();
				
			Конецесли;
		Конеццикла;
		
		
	Конецесли;
	
	Ошибки=NNN["result"]["error_details"];
	
	ПолОб.Ошибки.Очистить();
	Если Ошибки<>Неопределено Тогда
			
		Для Каждого Стр_11 Из Ошибки["items"] Цикл
			
			gtin=Стр_11["gtin"];
			Добав=ПолОб.Ошибки.Добавить();
			Добав.GTIN=gtin;
			Ошибки="";
			Для Каждого Стр_Ош Из Стр_11["errors"] Цикл
				Если ЗначениеЗаполнено(Ошибки) тогда
					Ошибки=Ошибки+Символы.ПС
				Конецесли;
				
				Ошибки=Ошибки+Стр_Ош["text"];
			Конеццикла;
			Добав.Ошибки=Ошибки;
			
		Конеццикла;
	Конецесли;
	
	ПолОб.Записать();
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
		Если Не Форм.Открыта() Тогда
			ФОрм.Открыть();
			ЭтаФОрма.Активизировать();
			
		Конецесли;
		ТекущийПользователь=Форм.Пользователь;
	Конецесли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВЦРПТ(Команда)
	// Вставить содержимое обработчика.
	Для Каждого ССтр Из Элементы.Список.ВыделенныеСтроки Цикл
		Форм=ПолучитьФорму("Документ.ОтправкаКарточекВНКПоAPI_ХамелеонЦРПТ.Форма.ФормаДокумента",
		Новый Структура("Ключ",ССтр));
		Форм.ОтправитьВЦРПТ(Команда);
		
	Конеццикла;
	
КонецПроцедуры
